<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 5 changes.</summary>

```diff
+ tailscale_tailnet_key.key will be created
! terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
+ module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
! module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
+ module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 1 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-05T05:43:33Z [(view log)](https://github.com/perchnet/p/actions/runs/16741621950/job/47391070838#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.key will be created
  + resource "tailscale_tailnet_key" "key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 3600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:komodo-periphery",
        ]
      + user_id       = (known after apply)
    }

  # terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
  ~ resource "terraform_data" "tailscale_node_deletion_hook" {
        id               = "aa300efb-c501-faee-8c42-30d09544594b"
      ~ input            = (sensitive value)
      ~ output           = [
          - "nhx2BCDuzD11CNTRL",
          - "tskey-api-k4RAc96VpW11CNTRL-QaiC9MUN1tCW7RkojVbkyCa1KDRJYmBg",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
  + resource "proxmox_virtual_environment_vm" "coreos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "tf-coreos-periphery-E1o"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-zfs"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "snippets:snippets/120830cf.butane-ci-user-data.ign"
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 2048
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "example.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/example.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu_dev_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "ubuntu-dev"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "ubuntu",
          + "tailscale",
          + "docker",
          + "dev",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + import_from       = "zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "zssd-files"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEyhYKsPcfOeY139vtFE5E5KTsdtAboxZD8jRvy2VpBA",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 4096
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + tpm_state {
          + datastore_id = "zssd"
          + version      = "v2.0"
        }

      + vga (known after apply)

      + virtiofs {
          + cache        = "always"
          + direct_io    = true
          + expose_acl   = false
          + expose_xattr = false
          + mapping      = "rust-root"
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->